CSI API ETABS v1

# cCaseStaticNonlinearStagedGetHingeUnloading Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetHingeUnloading(
    	string Name,
    	ref int UnloadType
    )

    Function GetHingeUnloading (
    	Name As String,
    	ByRef UnloadType As Integer
    ) As Integer

    Dim instance As cCaseStaticNonlinearStaged
    Dim Name As String
    Dim UnloadType As Integer
    Dim returnValue As Integer

    returnValue = instance.GetHingeUnloading(Name,
    	UnloadType)

    int GetHingeUnloading(
    	String^ Name,
    	int% UnloadType
    )

    abstract GetHingeUnloading :
            Name : string *
            UnloadType : int byref -> int

#### Parameters

Name

    Type: SystemString

UnloadType

    Type: SystemInt32

#### Return Value

Type: Int32

See Also

#### Reference

cCaseStaticNonlinearStaged
Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com